#include <Arduino.h>

// Р С™Р В»Р В°РЎРѓРЎРѓ Р Т‘Р В»РЎРЏ РЎС“Р С—РЎР‚Р В°Р Р†Р В»Р ВµР Р…Р С‘РЎРЏ Р Т‘Р Р†Р С‘Р В¶Р ВµР Р…Р С‘Р ВµР С�
class Motor {
    public:
        Motor(int, int, int); // Р С”Р С•Р Р…РЎРѓРЎвЂљРЎР‚РЎС“Р С”РЎвЂљР С•РЎР‚
        void setForward(); // РЎС“РЎРѓРЎвЂљР В°Р Р…Р С•Р Р†Р С”Р В° Р Т‘Р Р†Р С‘Р В¶Р ВµР Р…Р С‘РЎРЏ Р Р†Р С—Р ВµРЎР‚Р ВµР Т‘
        void setReverse(); // РЎС“РЎРѓРЎвЂљР В°Р Р…Р С•Р Р†Р С”Р В° Р Т‘Р Р†Р С‘Р В¶Р ВµР Р…Р С‘РЎРЏ Р Р…Р В°Р В·Р В°Р Т‘
        void stop();
        void setSpeed(int); // РЎС“РЎРѓРЎвЂљР В°Р Р…Р С•Р Р†Р С”Р В° РЎРѓР С”Р С•РЎР‚Р С•РЎРѓРЎвЂљР С‘
        byte getDirection(); // Р С—Р С•Р В»РЎС“РЎвЂЎР ВµР Р…Р С‘Р Вµ Р Р…Р В°Р С—РЎР‚Р В°Р Р†Р В»Р ВµР Р…Р С‘РЎРЏ (+1, -1, 0)
    private:
        byte direction = 0; // Р Р…Р В°Р С—РЎР‚Р В°Р Р†Р В»Р ВµР Р…Р С‘Р Вµ
        int pwmPin; //Р РЃР пїЅР Сљ-Р Р†РЎвЂ№РЎвЂ¦Р С•Р Т‘
        int pin1, pin2; //Р С—Р С‘Р Р…РЎвЂ№ Р Р…Р В°Р С—РЎР‚Р В°Р Р†Р В»Р ВµР Р…Р С‘РЎРЏ (+,- Р Р† РЎРѓР В»РЎС“РЎвЂЎР В°Р Вµ Р Т‘Р Р†Р С‘Р В¶Р ВµР Р…Р С‘РЎРЏ Р Р†Р С—Р ВµРЎР‚Р ВµР Т‘)
};

//Р С™Р В»Р В°РЎРѓРЎРѓ Р Т‘Р В»РЎРЏ РЎС“Р С—РЎР‚Р В°Р Р†Р В»Р ВµР Р…Р С‘РЎРЏ Р Т‘Р Р†Р С‘Р В¶Р ВµР Р…Р С‘Р ВµР С�
class DriveSystem {
    public:
        DriveSystem(Motor*, Motor*); // Р С”Р С•Р Р…РЎРѓРЎвЂљРЎР‚РЎС“Р С”РЎвЂљР С•РЎР‚

        int getLeftSpeed(); // Р С—Р С•Р В»РЎС“РЎвЂЎР ВµР Р…Р С‘Р Вµ Р В»Р ВµР Р†Р С•Р в„– РЎРѓР С”Р С•РЎР‚Р С•РЎРѓРЎвЂљР С‘
        int getRightSpeed(); // Р С—Р С•Р В»РЎС“РЎвЂЎР ВµР Р…Р С‘Р Вµ Р С—РЎР‚Р В°Р Р†Р С•Р в„– РЎРѓР С”Р С•РЎР‚Р С•РЎРѓРЎвЂљР С‘

        void setSpeed(int, int); // Р С�Р ВµРЎвЂљР С•Р Т‘ РЎС“РЎРѓРЎвЂљР В°Р Р…Р С•Р Р†Р С”Р С‘ РЎРѓР С”Р С•РЎР‚Р С•РЎРѓРЎвЂљР С‘
    private:
        //РЎРѓРЎРѓРЎвЂ№Р В»Р С”Р С‘ Р Р…Р В° Р С�Р С•РЎвЂљР С•РЎР‚РЎвЂ№
        Motor *leftMotor;
        Motor *rightMotor;

        //РЎвЂ¦РЎР‚Р В°Р Р…Р С‘Р С�РЎвЂ№Р Вµ РЎРѓР С”Р С•РЎР‚Р С•РЎРѓРЎвЂљР С‘
        int leftSpeed = 0;
        int rightSpeed = 0;
};
